"""百钱买百鸡"""

"""
【问题描述】
    用100文钱买100只鸡, 其中公鸡5文一只，母鸡3文一只，小鸡1文三只
    求各买几只
【设计思路】
    设公鸡，母鸡，小鸡各x,y,z只
    x + y + z = 100 
    5x + 3y + z/3 = 100
    那么如果全部买公鸡， 则最多买 100 /5 = 20只 所以x 的取值范围是[0, 20] 
    母鸡最多买 100 /3 = 33只 y 取值范围是[0, 33]
    小鸡 100 * 3 = 300只，但是总共买了100只，所以 z 取值范围是[0, 100]
"""

for x in range(21):
    for y in range(34):
        # 注意这里步长是3
        for z in range ( 0, 101, 3 ):
            if x + y + z == 100 and 5 * x + 3 * y + z /3 == 100:
                print('公鸡:%d, 母鸡:%d, 小鸡:%d' % (x, y ,z))

